#### AnalyzesAsType Enumeration

---

|  |
| --- |
| See Also |

This enum class is used for the BuiltInParameter STRUCTURAL\_ANALYZES\_AS.

**Namespace:**   Autodesk.Revit.DB
  **Assembly:**   RevitAPI  (in RevitAPI.dll) Version: 2015.0.0.0 (2015.0.0.0)

# Syntax

| C# |
| --- |
| ``` public enum AnalyzesAsType ``` |

| Visual Basic |
| --- |
| ``` Public Enumeration AnalyzesAsType ``` |

| Visual C++ |
| --- |
| ``` public enum class AnalyzesAsType ``` |

# Members

| Member name | Description |
| --- | --- |
| AA\_Hanger |  |
| AA\_Gravity |  |
| AA\_Lateral |  |
| AA\_SlabOneWay |  |
| AA\_Mat |  |
| AA\_SlabOnGrade |  |
| AA\_Not\_For\_Analysis |  |
| AA\_SlabTwoWay |  |
| AA\_GravityLateral |  |

# See Also

Autodesk.Revit.DB Namespace